#pragma once
#include <Arduino.h>
#include "pdDisplay.h"
#include "pdNearFieldCommunication.h"
#include "pdBuzzer.h"
#include "pdLed.h"
#include "pdRelay.h"

namespace Devices
{
	///--------------------------------------------------------------------------------------





	 ///=====================================================================================
	///
	/// Сам девайс
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class ADevice
	{
	public:
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Constructor.
		///--------------------------------------------------------------------------------------
		ADevice();
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Destructor
		/// 
		/// 
		///--------------------------------------------------------------------------------------
		virtual ~ADevice();
		///--------------------------------------------------------------------------------------



		void begin();	//инциализация считывателя меток
		void update();	//обновление состояния считывания меток


		///--------------------------------------------------------------------------------------
		/// сами устройства
		///--------------------------------------------------------------------------------------
		ANearFieldCommunication		nfc;	//считыватель карт
		ADisplay					display;//экран
		ARelay						relay;	//релюха управляющая
		ABuzzer						buzzer;	//пищалка
		ALed						led;	//светодиод





		//заблокируем копирование
		ADevice& operator = (const ADevice&) = delete;
		ADevice(const ADevice&) = delete;

	private:

	
		
	};

}
