#pragma once
#include <Arduino.h>
#include <MFRC522.h>

#include <vector>
namespace NFC
{
	///--------------------------------------------------------------------------------------





	 ///=====================================================================================
	///
	/// Удаленный считыватель карт
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class ANearFieldCommunication
	{
	public:
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Constructor.
		///--------------------------------------------------------------------------------------
		ANearFieldCommunication();
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Destructor
		/// 
		/// 
		///--------------------------------------------------------------------------------------
		virtual ~ANearFieldCommunication();
		///--------------------------------------------------------------------------------------



		void begin();	//инциализация считывателя меток
		void update();	//обновление состояния считывания меток



		//заблокируем копирование
		ANearFieldCommunication& operator = (const ANearFieldCommunication&) = delete;
		ANearFieldCommunication(const ANearFieldCommunication&) = delete;

	private:

	
		MFRC522		mDevice;
		int			mIndex;		//индекс обрабатываемой карточки
	};

}
