#pragma once
#include <Arduino.h>
namespace Options
{
	///--------------------------------------------------------------------------------------
	const int CRCKey = 0x9A;

	struct TData
	{
		char crc;					//магическое число CRCKey
		unsigned char ssid[30];		//точка доступа
		unsigned char password[30];	//пароль для точки доступа
		unsigned char name[30];		//имя устройтсва
		unsigned char token[20];	//токен для доступа
	};
	///--------------------------------------------------------------------------------------




	 ///=====================================================================================
	///
	/// Сохранение настроек
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AOptions
	{
	public:
		///--------------------------------------------------------------------------------------





		///=====================================================================================
		///
		/// Constructor.
		///--------------------------------------------------------------------------------------
		AOptions();
		///--------------------------------------------------------------------------------------





		///=====================================================================================
		///
		/// Destructor
		/// 
		/// 
		///--------------------------------------------------------------------------------------
		virtual ~AOptions();
		///--------------------------------------------------------------------------------------


		void reinitialize(); //вернуть настройки по умолчанию



		///--------------------------------------------------------------------------------------
		/// настрйоки точки доступа

		String	ssid		()const;					//имя точки доступа
		String	password	()const;					//пароль для точки доступа
		void	setSsid		(const String &ssid);		//установка индификатора точки доступа
		void	setPassword	(const String &password);	//устновка пароля
		///--------------------------------------------------------------------------------------


		String	name		()const;					//возвратить имя устройства
		void	setName		(const String &name);		//утсновка иммя устройства


		String	token		()const;					//возратить токен доступа (пароль сервера)
		void	setToken	(const String &token);		//установка токена

		

		//заблокируем копирование
		AOptions& operator = (const AOptions&) = delete;
		AOptions(const AOptions&) = delete;

	private:


		
		void read(TData &data) const; //чтение данных
		void write(const TData &data); //запись данных
		void defaultData(TData &data) const; //установим данные по умолчанию

	};

}
