#pragma once
#include <Arduino.h>
#include "pdMD5.h"
#include "pdProtocol.h"
namespace Network
{
namespace STP
{
	///--------------------------------------------------------------------------------------
	#pragma push pack(1)
	
	//система подсчета правельности пакета
	struct TSelectorHash
	{
		uint32_t	sequence;	//индификатор пакета
		uint8_t		typeAction; //тип команды
		uint8_t		token[11];	//закрытый токен доступа
	};

	#pragma pop pack
	///--------------------------------------------------------------------------------------







	 ///=====================================================================================
	///
	/// Система подключения к серверу
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class ASecurityTokenPolicy
	{
	public:
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Constructor.
		///--------------------------------------------------------------------------------------
		ASecurityTokenPolicy();
		///--------------------------------------------------------------------------------------





		 ///=====================================================================================
		///
		/// Destructor
		/// 
		/// 
		///--------------------------------------------------------------------------------------
		virtual ~ASecurityTokenPolicy();
		///--------------------------------------------------------------------------------------





		void setToken(const String &token); //установка токена
		String token()const; //получить текущий токен



		bool securityCheck (const Protocol::THeader *header); //проверка на безопасность данных



		//заблокируем копирование
		ASecurityTokenPolicy& operator = (const ASecurityTokenPolicy&) = delete;
		ASecurityTokenPolicy(const ASecurityTokenPolicy&) = delete;

	private:

		
		Utils::AMD5		mMD5;	//расчет контрольных сумм
		TSelectorHash	mHash;	//данные для расчета хеша
	};

}
}